#ifndef HIDL_GENERATED_ANDROID_HIDL_MANAGER_V1_0_ISERVICEMANAGER_H
#define HIDL_GENERATED_ANDROID_HIDL_MANAGER_V1_0_ISERVICEMANAGER_H

#include <android/hidl/base/1.0/IBase.h>
#include <android/hidl/base/1.0/types.h>
#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hidl {
namespace manager {
namespace V1_0 {

/**
 * Manages all the hidl hals on a device.
 *
 * All examples in this file assume that there is one service registered with
 * the service manager, "android.hidl.manager@1.0::IServiceManager/manager"
 *
 * Terminology:
 *   Package: "android.hidl.manager"
 *   Major version: "1"
 *   Minor version: "0"
 *   Version: "1.0"
 *   Interface name: "IServiceManager"
 *   Fully-qualified interface name: "android.hidl.manager@1.0::IServiceManager"
 *   Instance name: "manager"
 *   Fully-qualified instance name: "android.hidl.manager@1.0::IServiceManager/manager"
 */
struct IServiceManager : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hidl.manager@1.0::IServiceManager"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class Transport : uint8_t;
    enum class PidConstant : int32_t;
    struct InstanceDebugInfo;

    enum class Transport : uint8_t {
        EMPTY = 0,
        HWBINDER = 1 /* ::android::hidl::manager::V1_0::IServiceManager::Transport.EMPTY implicitly + 1 */,
        PASSTHROUGH = 2 /* ::android::hidl::manager::V1_0::IServiceManager::Transport.HWBINDER implicitly + 1 */,
    };

    /**
     * Special values for InstanceDebugInfo pids.
     */
    enum class PidConstant : int32_t {
        NO_PID = -1 /* -1 */,
    };

    /**
     * Returned object for debugDump().
     */
    struct InstanceDebugInfo final {
        ::android::hardware::hidl_string interfaceName __attribute__ ((aligned(8)));
        ::android::hardware::hidl_string instanceName __attribute__ ((aligned(8)));
        int32_t pid __attribute__ ((aligned(4)));
        ::android::hardware::hidl_vec<int32_t> clientPids __attribute__ ((aligned(8)));
        ::android::hidl::base::V1_0::DebugInfo::Architecture arch __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo, interfaceName) == 0, "wrong offset");
    static_assert(offsetof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo, instanceName) == 16, "wrong offset");
    static_assert(offsetof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo, pid) == 32, "wrong offset");
    static_assert(offsetof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo, clientPids) == 40, "wrong offset");
    static_assert(offsetof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo, arch) == 56, "wrong offset");
    static_assert(sizeof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo) == 64, "wrong size");
    static_assert(__alignof(::android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Retrieve an existing service that supports the requested version.
     *
     * WARNING: This function is for libhidl/HwBinder use only. You are likely
     * looking for 'IMyInterface::getService("name")' instead.
     *
     * @param fqName   Fully-qualified interface name.
     * @param name     Instance name. Same as in IServiceManager::add.
     *
     * @return service Handle to requested service, same as provided in
     *                 IServiceManager::add. Will be nullptr if not available.
     */
    virtual ::android::hardware::Return<::android::sp<::android::hidl::base::V1_0::IBase>> get(const ::android::hardware::hidl_string& fqName, const ::android::hardware::hidl_string& name) = 0;
